---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
source: html/bcb9379e-3621-c5af-4998-f32903db8316.htm
---
# StructuralSectionGeneralS Properties

Common set of parameters for structural analysis.